# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:

* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM ERD

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='https://curriculum-content.s3.amazonaws.com/data-science/images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite')

## Select the names of all employees in Boston 

Hint: join the employees and offices tables. Select the first and last name.

In [ ]:
select firstName, lastName 
from employees as em
join offices as ofc on em.officeCode = ofc.officeCode
where city = 'Boston'

In [10]:
# Your code here
df = pd.read_sql("""
select firstName, lastName 
from employees as em
join offices as ofc on em.officeCode = ofc.officeCode
where city = 'Boston'
""", conn)
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by. Select the office code, city, and number of employees.

In [ ]:
select ofc.officeCode, ofc.city, count(*) as num_employees
from employees as em
join offices as ofc on em.officeCode = ofc.officeCode
group by em.officeCode
order by num_employees

In [19]:
# Your code here
df = pd.read_sql("""
select ofc.officeCode, ofc.city, count(em.employeeNumber) as num_employees
from employees as em
full join offices as ofc on em.officeCode = ofc.officeCode
group by em.officeCode
order by num_employees
""", conn)
df

   officeCode           city  num_employees
0          27         Boston              0
1           2         Boston              2
2           3            NYC              2
3           5          Tokyo              2
4           7         London              2
5           6         Sydney              4
6           4          Paris              5
7           1  San Francisco              6

## Write 3 questions of your own and answer them

In [ ]:
# Answers will vary

# Example question: 
"""
How many customers are there per office?
"""

In [ ]:
"""
Question 1
"""

# Your code here

In [ ]:
"""
Question 2
"""

# Your code here

In [ ]:
"""
Question 3
"""

# Your code here

## Level Up 1: Display the names of every individual product that each employee has sold

Hint: You will need to use multiple `JOIN` clauses to connect all the way from employee names to product names.

In [ ]:
select prod.productName, em.firstName, em.lastName
from ((((products as prod
join orderdetails as od on prod.productCode = od.productCode) 
join orders as ords on od.orderNumber = ords.orderNumber)
join customers as cust on ords.customerNumber = cust.customerNumber)
join employees as em on cust.contactLastName, cust.contactFirstName = em.lastName, em.firstName)

In [23]:
# Your code here
df = pd.read_sql("""
select prod.productName, em.firstName, em.lastName
from ((((products as prod
join orderdetails as od on prod.productCode = od.productCode) 
join orders as ords on od.orderNumber = ords.orderNumber)
join customers as cust on ords.customerNumber = cust.customerNumber)
join employees as em on cust.salesRepEmployeeNumber = em.employeeNumber)
""", conn)
df

                                productName firstName   lastName
0     1969 Harley Davidson Ultimate Chopper    George     Vanauf
1     1969 Harley Davidson Ultimate Chopper      Loui     Bondur
2     1969 Harley Davidson Ultimate Chopper      Loui     Bondur
3     1969 Harley Davidson Ultimate Chopper    Leslie   Thompson
4     1969 Harley Davidson Ultimate Chopper    Leslie   Jennings
...                                     ...       ...        ...
2991                             Pont Yacht     Peter      Marsh
2992                             Pont Yacht     Larry       Bott
2993                             Pont Yacht    Gerard  Hernandez
2994                             Pont Yacht    Gerard  Hernandez
2995                             Pont Yacht     Steve  Patterson

[2996 rows x 3 columns]

## Level Up 2: Display the number of products each employee has sold

Alphabetize the results by employee last name.

Hint: Use the `quantityOrdered` column from `orderDetails`. Also, think about how to group the data when some employees might have the same first or last name.

In [25]:
# Your code here
df = pd.read_sql("""
select em.firstName, em.lastName, sum(cast(od.quantityOrdered as int)) as num_prod
from ((((products as prod
join orderdetails as od on prod.productCode = od.productCode) 
join orders as ords on od.orderNumber = ords.orderNumber)
join customers as cust on ords.customerNumber = cust.customerNumber)
join employees as em on cust.salesRepEmployeeNumber = em.employeeNumber)
group by em.lastName, em.firstName
""", conn)
df

   firstName   lastName  num_prod
0       Loui     Bondur      6186
1      Larry       Bott      8205
2     Pamela   Castillo      9290
3      Julie   Firrelli      4227
4       Andy     Fixter      6246
5     Martin     Gerard      4180
6     Gerard  Hernandez     14231
7     Leslie   Jennings     11854
8      Barry      Jones      7486
9      Peter      Marsh      6632
10      Mami      Nishi      4923
11     Steve  Patterson      5561
12    Leslie   Thompson      4056
13  Foon Yue      Tseng      5016
14    George     Vanauf      7423

## Level Up 3: Display the names employees who have sold more than 200 different products

Hint: this is different from the previous question because the quantity sold doesn't matter, only the number of different products

In [27]:
# Your code here
df = pd.read_sql("""
select em.firstName, em.lastName, count(distinct prod.productCode) as unique_prod
from ((((products as prod
join orderdetails as od on prod.productCode = od.productCode) 
join orders as ords on od.orderNumber = ords.orderNumber)
join customers as cust on ords.customerNumber = cust.customerNumber)
join employees as em on cust.salesRepEmployeeNumber = em.employeeNumber)
group by em.lastName, em.firstName
having unique_prod > 200
""", conn)
df

Empty DataFrame
Columns: [firstName, lastName, unique_prod]
Index: []

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!